; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	image1 - mode
	thermograph0 - mode
	Star1 - direction
	GroundStation2 - direction
	Star4 - direction
	GroundStation3 - direction
	Star0 - direction
	Star5 - direction
	Star6 - direction
	Star7 - direction
	Phenomenon8 - direction
	Planet9 - direction
	Star10 - direction
	Star11 - direction
	Phenomenon12 - direction
	Planet13 - direction
	Star14 - direction
	Star15 - direction
	Star16 - direction
	Phenomenon17 - direction
	Star18 - direction
	Planet19 - direction
)
(:init
	(supports instrument0 thermograph0)
	(calibration_target instrument0 GroundStation3)
	(supports instrument1 image1)
	(supports instrument1 thermograph0)
	(calibration_target instrument1 Star0)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Phenomenon17)
)
(:goal (and
	(have_image Star5 thermograph0)
	(have_image Star6 thermograph0)
	(have_image Star7 thermograph0)
	(have_image Phenomenon8 image1)
	(have_image Planet9 image1)
	(have_image Star10 image1)
	(have_image Star11 image1)
	(have_image Phenomenon12 image1)
	(have_image Planet13 image1)
	(have_image Star14 image1)
	(have_image Star15 thermograph0)
	(have_image Star16 image1)
	(have_image Phenomenon17 thermograph0)
	(have_image Star18 thermograph0)
	(have_image Planet19 image1)
))

)

; plan
1. (turn_to satellite0 star0 phenomenon17)
   deleted: (pointing satellite0 phenomenon17)
   added: (pointing satellite0 star0)
   goals met: 0 of 15
2. (switch_on instrument1 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument1)
   goals met: 0 of 15
3. (calibrate satellite0 instrument1 star0)
   added: (calibrated instrument1)
   goals met: 0 of 15
4. (turn_to satellite0 planet13 star0)
   deleted: (pointing satellite0 star0)
   added: (pointing satellite0 planet13)
   goals met: 0 of 15
5. (take_image satellite0 planet13 instrument1 image1)
   added: (have_image planet13 image1)
   goals met: 1 of 15
6. (turn_to satellite0 phenomenon8 planet13)
   deleted: (pointing satellite0 planet13)
   added: (pointing satellite0 phenomenon8)
   goals met: 1 of 15
7. (take_image satellite0 phenomenon8 instrument1 image1)
   added: (have_image phenomenon8 image1)
   goals met: 2 of 15
8. (turn_to satellite0 phenomenon17 phenomenon8)
   deleted: (pointing satellite0 phenomenon8)
   added: (pointing satellite0 phenomenon17)
   goals met: 2 of 15
9. (take_image satellite0 phenomenon17 instrument1 thermograph0)
   added: (have_image phenomenon17 thermograph0)
   goals met: 3 of 15
10. (turn_to satellite0 phenomenon12 phenomenon17)
   deleted: (pointing satellite0 phenomenon17)
   added: (pointing satellite0 phenomenon12)
   goals met: 3 of 15
11. (take_image satellite0 phenomenon12 instrument1 image1)
   added: (have_image phenomenon12 image1)
   goals met: 4 of 15
12. (turn_to satellite0 planet19 phenomenon12)
   deleted: (pointing satellite0 phenomenon12)
   added: (pointing satellite0 planet19)
   goals met: 4 of 15
13. (take_image satellite0 planet19 instrument1 image1)
   added: (have_image planet19 image1)
   goals met: 5 of 15
14. (turn_to satellite0 planet9 planet19)
   deleted: (pointing satellite0 planet19)
   added: (pointing satellite0 planet9)
   goals met: 5 of 15
15. (take_image satellite0 planet9 instrument1 image1)
   added: (have_image planet9 image1)
   goals met: 6 of 15
16. (turn_to satellite0 star10 planet9)
   deleted: (pointing satellite0 planet9)
   added: (pointing satellite0 star10)
   goals met: 6 of 15
17. (take_image satellite0 star10 instrument1 image1)
   added: (have_image star10 image1)
   goals met: 7 of 15
18. (turn_to satellite0 star11 star10)
   deleted: (pointing satellite0 star10)
   added: (pointing satellite0 star11)
   goals met: 7 of 15
19. (take_image satellite0 star11 instrument1 image1)
   added: (have_image star11 image1)
   goals met: 8 of 15
20. (turn_to satellite0 star14 star11)
   deleted: (pointing satellite0 star11)
   added: (pointing satellite0 star14)
   goals met: 8 of 15
21. (take_image satellite0 star14 instrument1 image1)
   added: (have_image star14 image1)
   goals met: 9 of 15
22. (turn_to satellite0 star15 star14)
   deleted: (pointing satellite0 star14)
   added: (pointing satellite0 star15)
   goals met: 9 of 15
23. (take_image satellite0 star15 instrument1 thermograph0)
   added: (have_image star15 thermograph0)
   goals met: 10 of 15
24. (turn_to satellite0 star16 star15)
   deleted: (pointing satellite0 star15)
   added: (pointing satellite0 star16)
   goals met: 10 of 15
25. (take_image satellite0 star16 instrument1 image1)
   added: (have_image star16 image1)
   goals met: 11 of 15
26. (turn_to satellite0 star18 star16)
   deleted: (pointing satellite0 star16)
   added: (pointing satellite0 star18)
   goals met: 11 of 15
27. (take_image satellite0 star18 instrument1 thermograph0)
   added: (have_image star18 thermograph0)
   goals met: 12 of 15
28. (turn_to satellite0 star5 star18)
   deleted: (pointing satellite0 star18)
   added: (pointing satellite0 star5)
   goals met: 12 of 15
29. (take_image satellite0 star5 instrument1 thermograph0)
   added: (have_image star5 thermograph0)
   goals met: 13 of 15
30. (turn_to satellite0 star6 star5)
   deleted: (pointing satellite0 star5)
   added: (pointing satellite0 star6)
   goals met: 13 of 15
31. (take_image satellite0 star6 instrument1 thermograph0)
   added: (have_image star6 thermograph0)
   goals met: 14 of 15
32. (turn_to satellite0 star7 star6)
   deleted: (pointing satellite0 star6)
   added: (pointing satellite0 star7)
   goals met: 14 of 15
33. (take_image satellite0 star7 instrument1 thermograph0)
   added: (have_image star7 thermograph0)
   goals met: 15 of 15
